import java.util.List;
import java.util.Map;

public class Calculation {
    public static List calculation(String start, String end) {

        // Все станции метро
        WeightedGraph<String> cityGraph = new WeightedGraph<>(
                List.of("Автово", "Адмиралтейская", "Академическая", "Балтийская", "Бухарестская", "Беговая",
                        "Василеостровская", "Владимирская", "Волковская", "Выборгская", "Горьковская",
                        "Гостиный двор", "Гражданский проспект", "Девяткино", "Достоевская", "Дунайская", "Елизаровская",
                        "Звездная", "Звенигородская", "Зенит", "Кировский завод", "Комендантский проспект",
                        "Крестовский остров", "Купчино", "Ладожская", "Ленинский проспект", "Лесная",
                        "Лиговский проспект", "Ломоносовская", "Маяковская", "Международная", "Московская",
                        "Московские ворота", "Нарвская", "Невский проспект", "Новочеркасская",
                        "Обводный канал", "Обухово", "Озерки", "Парк Победы", "Парнас", "Петроградская",
                        "Пионерская", "Площадь Александра Невского 1", "Площадь Александра Невского 2", "Площадь Восстания",
                        "Площадь Ленина", "Площадь Мужества", "Политехническая", "Приморская", "Пролетарская",
                        "Проспект Большевиков", "Проспект Ветеранов", "Проспект Просвещения", "Проспект Славы",
                        "Пушкинская", "Рыбацкое",
                        "Садовая", "Сенная площадь", "Спасская", "Спортивная", "Старая Деревня", "Технологический институт 1",
                        "Технологический институт 2", "Удельная", "Улица Дыбенко", "Фрунзенская", "Черная речка",
                        "Чернышевская", "Чкаловская", "Шушары", "Электросила"));

        // Ребра красной ветки с временем
        cityGraph.addEdge("Девяткино", "Гражданский проспект", 4);
        cityGraph.addEdge("Гражданский проспект", "Академическая", 4);
        cityGraph.addEdge("Академическая", "Политехническая", 2);
        cityGraph.addEdge("Политехническая", "Площадь Мужества", 2);
        cityGraph.addEdge("Площадь Мужества", "Лесная", 3);
        cityGraph.addEdge("Лесная", "Выборгская", 3);
        cityGraph.addEdge("Выборгская", "Площадь Ленина", 3);
        cityGraph.addEdge("Площадь Ленина", "Чернышевская", 3);
        cityGraph.addEdge("Чернышевская", "Площадь Восстания", 3);
        cityGraph.addEdge("Площадь Восстания", "Владимирская", 2);
        cityGraph.addEdge("Владимирская", "Пушкинская", 2);
        cityGraph.addEdge("Пушкинская", "Технологический институт 1", 1);
        cityGraph.addEdge("Технологический институт 1", "Балтийская", 2);
        cityGraph.addEdge("Балтийская", "Нарвская", 3);
        cityGraph.addEdge("Нарвская", "Кировский завод", 4);
        cityGraph.addEdge("Кировский завод", "Автово", 2);
        cityGraph.addEdge("Автово", "Ленинский проспект", 3);
        cityGraph.addEdge("Ленинский проспект", "Проспект Ветеранов", 2);

        // Ребра синей ветки
        cityGraph.addEdge("Парнас", "Проспект Просвещения", 3);
        cityGraph.addEdge("Проспект Просвещения", "Озерки", 2);
        cityGraph.addEdge("Озерки", "Удельная", 3);
        cityGraph.addEdge("Удельная", "Пионерская", 3);
        cityGraph.addEdge("Пионерская", "Черная речка", 3);
        cityGraph.addEdge("Черная речка", "Петроградская", 4);
        cityGraph.addEdge("Петроградская", "Горьковская", 2);
        cityGraph.addEdge("Горьковская", "Невский проспект", 4);
        cityGraph.addEdge("Невский проспект", "Сенная площадь", 2);
        cityGraph.addEdge("Сенная площадь", "Технологический институт 2", 2);
        cityGraph.addEdge("Технологический институт 2", "Фрунзенская", 2);
        cityGraph.addEdge("Фрунзенская", "Московские ворота", 3);
        cityGraph.addEdge("Московские ворота", "Электросила", 2);
        cityGraph.addEdge("Электросила", "Парк Победы", 2);
        cityGraph.addEdge("Парк Победы", "Московская", 3);
        cityGraph.addEdge("Московская", "Звездная", 5);
        cityGraph.addEdge("Звездная", "Купчино", 3);

        // Ребра фиолетовой ветки
        cityGraph.addEdge("Комендантский проспект", "Старая Деревня", 4);
        cityGraph.addEdge("Старая Деревня", "Крестовский остров", 3);
        cityGraph.addEdge("Крестовский остров", "Чкаловская", 3);
        cityGraph.addEdge("Чкаловская", "Спортивная", 2);
        cityGraph.addEdge("Спортивная", "Адмиралтейская", 3);
        cityGraph.addEdge("Адмиралтейская", "Садовая", 2);
        cityGraph.addEdge("Садовая", "Звенигородская", 3);
        cityGraph.addEdge("Звенигородская", "Обводный канал", 3);
        cityGraph.addEdge("Обводный канал", "Волковская", 3);
        cityGraph.addEdge("Волковская", "Бухарестская", 3);
        cityGraph.addEdge("Бухарестская", "Международная", 3);
        cityGraph.addEdge("Международная", "Проспект Славы", 2);
        cityGraph.addEdge("Проспект Славы", "Дунайская", 3);
        cityGraph.addEdge("Дунайская", "Шушары", 3);

        // Ребра зеленой ветки
        cityGraph.addEdge("Беговая", "Зенит", 4);
        cityGraph.addEdge("Зенит", "Приморская", 3);
        cityGraph.addEdge("Приморская", "Василеостровская", 4);
        cityGraph.addEdge("Василеостровская", "Гостиный двор", 4);
        cityGraph.addEdge("Гостиный двор", "Маяковская", 3);
        cityGraph.addEdge("Маяковская", "Площадь Александра Невского 1", 3);
        cityGraph.addEdge("Площадь Александра Невского 1", "Елизаровская", 4);
        cityGraph.addEdge("Елизаровская", "Ломоносовская", 3);
        cityGraph.addEdge("Ломоносовская", "Пролетарская", 4);
        cityGraph.addEdge("Пролетарская", "Обухово", 3);
        cityGraph.addEdge("Обухово", "Рыбацкое", 4);

        // Ребра оранжевой ветки
        cityGraph.addEdge("Спасская", "Достоевская", 4);
        cityGraph.addEdge("Достоевская", "Лиговский проспект", 2);
        cityGraph.addEdge("Лиговский проспект", "Площадь Александра Невского 2", 2);
        cityGraph.addEdge("Площадь Александра Невского 2", "Новочеркасская", 3);
        cityGraph.addEdge("Новочеркасская", "Ладожская", 3);
        cityGraph.addEdge("Ладожская", "Проспект Большевиков", 2);
        cityGraph.addEdge("Проспект Большевиков", "Улица Дыбенко", 3);

        // Пересадочные узлы
        cityGraph.addEdge("Сенная площадь", "Спасская", 4);
        cityGraph.addEdge("Сенная площадь", "Садовая", 4);
        cityGraph.addEdge("Садовая", "Спасская", 3);
        cityGraph.addEdge("Невский проспект", "Гостиный двор", 4);
        cityGraph.addEdge("Маяковская", "Площадь Восстания", 3);
        cityGraph.addEdge("Достоевская", "Владимирская", 3);
        cityGraph.addEdge("Пушкинская", "Звенигородская", 3);
        cityGraph.addEdge("Технологический институт 1", "Технологический институт 2", 2);
        cityGraph.addEdge("Площадь Александра Невского 1", "Площадь Александра Невского 2", 3);

        WeightedGraph.DijkstraResult dijkstraResult = cityGraph.dijkstra(start);
        List<WeightedEdge> path = WeightedGraph.pathMapToPath(cityGraph.indexOf(start), cityGraph.indexOf(end),
                dijkstraResult.pathMap);
        List<String> PATH = cityGraph.printWeightedPath(path);
        return PATH;
    }
}
